MobileInfoBase/src/DataProcessors/Д_ОбменСЦентральнойБазой/Д_ОбменСЦентральнойБазой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Д_ОбменСЦентральнойБазой</name>
  <comment>ДЗ 15-2-1</comment>
</mdclass:DataProcessor>

MobileInfoBase/src/Documents/Д_Доставка/Д_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Д_Доставка</name>
  <comment>ДЗ-12-1-1</comment>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Д_СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоДоставки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MobileInfoBase/src/DataProcessors/Д_ОбменСЦентральнойБазой/Forms/Форма/Module.bsl
#Область ОписаниеПеременных
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Перем ЗащищенноеСоединение; //Вид соединения. ЗащищенноеСоединениеOpenSSL или Неопределено
	Перем ПараметрыПодключения; //Параметры подключения. Структура
	Перем Соединение; //HTTP-Соединение дляя подключения к центральной базе. HTTPСоединение
	Перем НачалоАдресаСервера; //Часть строки адреса центральной базы начиная после "://"
	Перем АдресБезПротокола; // Часть строки адреса центральной базы без указания протокола соединения
	Перем НачалоРазделителя; // Часть строки центральной базы без указания протокола соединения до "/"
	Перем АдресСервера; //Адрес Сервера центральной базы
	Перем ИмяБазыНаСервере; //Имя центральной базы на сервере
	Перем ЗапросHTTP; //HTTP-запрос для подключения
	Перем Заголовки; //Заголовки HTTP-запроса. Соответствие
	Перем Ping; //HTTP-Сервис Д_ОбменСМобильнымКлиентом Шаблон URL Ping Метод GET
	Перем ОтветСервера; //Ответ сервера со сведениями о статусе подключения
	Перем ОтветСервераСтрока; //Ответ сервера со сведениями о статусе подключения. Строка
// Конец Володин А.А. 19 октября 2024 г.
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Д_АдресЦентральнойБазы.Значение КАК АдресЦентральнойБазы,
		|	Д_Логин.Значение КАК Логин,
		|	Д_Пароль.Значение КАК Пароль
		|ИЗ
		|	Константа.Д_АдресЦентральнойБазы КАК Д_АдресЦентральнойБазы,
		|	Константа.Д_Логин КАК Д_Логин,
		|	Константа.Д_Пароль КАК Д_Пароль";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АдресЦентральнойБазы = ВыборкаДетальныеЗаписи.АдресЦентральнойБазы;
		Логин = ВыборкаДетальныеЗаписи.Логин;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
	КонецЦикла;
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресЦентральнойБазыПриИзменении(Элемент)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ЗаписатьАдресЦентральнойБазыВКонстанту(АдресЦентральнойБазы);
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ЗаписатьЛогинВКонстанту(Логин);
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ЗаписатьПарольВКонстанту(Пароль);
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	ОтветСервера = ЗапросНаСервер(АдресЦентральнойБазы, "/hs/mobile/ping");
	
	ОтветСервераСтрока = ОтветСервера.ПолучитьТелоКакСтроку(); //При обмене с внешними сервисами необходимо указывать кодировку и раскодировать
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Error: " + ОтветСервераСтрока);
		Возврат;
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ok: " + ОтветСервераСтрока);
		
	КонецЕсли;
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЗаказов(Команда)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	//ОтветСервера = ЗапросНаСервер(АдресЦентральнойБазы, "/hs/mobile/delivery");
	//
	////Проверим статус ответа:
	//ОтветСервераСтрока = ОтветСервера.ПолучитьТелоКакСтроку(); //При обмене с внешними сервисами необходимо указывать кодировку и раскодировать
	//
	//Если ОтветСервера.КодСостояния <> 200 Тогда
	//	
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка соединения: " + ОтветСервераСтрока);
	//	Возврат;
	//	
	//Иначе
	//	
	//	МассивДоставок = ПрочитатьЗначениеJSON(ОтветСервераСтрока);
	//	
	//	ОбновитьСписокЗаказов(МассивДоставок);
	//	
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Соединение успешно: " + ОтветСервераСтрока);
	//	
	//КонецЕсли;
// Конец Володин А.А. 23 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьАдресЦентральнойБазыВКонстанту(АдресБазы)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Константы.Д_АдресЦентральнойБазы.Установить(АдресБазы);
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогинВКонстанту(Логин)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Константы.Д_Логин.Установить(Логин);
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПарольВКонстанту(Пароль)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Константы.Д_Пароль.Установить(Пароль);	
// Конец Володин А.А. 19 октября 2024 г.
КонецПроцедуры

&НаСервере
Функция  ЗапросНаСервер(АдресБазы, АдресСервиса)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	//Определим параметры подключения:
	ПараметрыПодключения = ПолучитьПараметрыПодключения(АдресБазы);
	
	//Создадим соединение:
	Соединение = УстановитьСоединение(ПараметрыПодключения);
	
	//Создадим и отправим HTTP-Запрос:
	Заголовки = Новый Соответствие();
	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыПодключения.ИмяБазыНаСервере + АдресСервиса, Заголовки);
	
	ОтветСервера = Соединение.Получить(ЗапросHTTP);
	
	Возврат ОтветСервера;
// Конец Володин А.А. 19 октября 2024 г.
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПодключения(АдресБазы)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Результат = Новый Структура;
	
	Если Лев(АдресБазы, 5) = "https" Тогда
		
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		
	Иначе
		
		ЗащищенноеСоединение = Неопределено;
		
	КонецЕсли;
	
	НачалоАдресаСервера = СтрНайти(АдресБазы, "://") + 3;
	АдресБезПротокола = Сред(АдресБазы, НачалоАдресаСервера);
	НачалоРазделителя = СтрНайти(АдресБезПротокола, "/");
	
	АдресСервера = Лев(АдресБезПротокола, НачалоРазделителя - 1);
	ИмяБазыНаСервере = Сред(АдресБезПротокола, НачалоРазделителя);
	
	Результат.Вставить("АдресСервера", АдресСервера);
	Результат.Вставить("ИмяБазыНаСервере", ИмяБазыНаСервере);
	Результат.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	
	Возврат Результат;
// Конец Володин А.А. 19 октября 2024 г.
КонецФункции

&НаСервере
Функция УстановитьСоединение(ПараметрыПодключения)
// Начало Володин А.А. 19 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства 
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, , ПараметрыПодключения.Логин, ПараметрыПодключения.Пароль, , ПараметрыПодключения.ЗащищенноеСоединение);
	
	Возврат Соединение;
// Конец Володин А.А. 19 октября 2024 г.	
КонецФункции

&НаСервере
Процедура ОбновитьСписокЗаказов(МассивДоставок)
	
	Для Каждого Доставка Из МассивДоставок Цикл
		
		//Проверим существует ли уже такой документ в нашей базе, если нет, то создадим новый:
		ИДДоставки = Новый УникальныйИдентификатор(Доставка.Ссылка);
		СсылкаДоставка = Документы.Д_Доставка.ПолучитьСсылку(ИДДоставки);
		ОбъектДоставка = СсылкаДоставка.ПолучитьОбъект();
		
		Если ОбъектДоставка = Неопределено Тогда 
			
			ОбъектДоставка = Документы.Д_Доставка.СоздатьДокумент();
			
		КонецЕсли;
		
		//Запишем полученные данные в новый или найденный наш объект:
		ОбъектДоставка.Дата = Доставка.Дата;
		ОбъектДоставка.Номер = Доставка.Номер;
		ОбъектДоставка.Организация = Доставка.Организация;
		ОбъектДоставка.Контрагент = Доставка.Контрагент;
		ОбъектДоставка.Договор = Доставка.Договор;
		ОбъектДоставка.АдресДоставки = Доставка.АдресДоставки;
		ОбъектДоставка.Основание = Доставка.Основание;
		ОбъектДоставка.Ответственный = Доставка.Ответственный;
		ОбъектДоставка.Комментарий = Доставка.Комментарий;
		ОбъектДоставка.Записать();
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
